//HERC04CO      JOB   USER=HERC04,PASSWORD=PASS4U,MSGCLASS=A
//              EXEC  COBUCL
//COB.SYSIN     DD    DSN=HERC04.SSTATS.SRC(SSTATS),DISP=SHR
//COB.SYSPUNCH  DD    SYSOUT=*
//COB.SYSLIB    DD    DSN=SYS1.COBLIB,DISP=SHR
//LKED.SYSLMOD  DD    DSN=HERC04.SSTATS.LOADLIB,DISP=SHR
//LKED.SYSIN    DD    *
  NAME SSTATS(R)
/*
