//HERC04CL  JOB   USER=HERC04,PASSWORD=PASS4U,MSGCLASS=A
//          EXEC  PGM=IEFBR14   
//SYSPRINT  DD    SYSOUT=*
//SYSIN     DD    DUMMY
//NEWFILE   DD    DSN=HERC04.SSTATS.LOADLIB,DISP=(NEW,CATLG),
//          UNIT=SYSDA,VOL=SER=PUB013,
//          SPACE=(TRK,(10,0,2)),
//          DCB=(DSORG=PO,RECFM=U,LRECL=80,BLKSIZE=19069)
//
