//HERC04CP  JOB   USER=HERC04,PASSWORD=PASS4U,MSGCLASS=A
//          EXEC  PGM=IEFBR14
//SYSPRINT  DD    SYSOUT=*
//SYSIN     DD    DUMMY
//NEWFILE   DD    DSN=HERC04.SSTATS.INPILE,DISP=(NEW,CATLG),
//          UNIT=SYSDA,VOL=SER=PUB013,
//          SPACE=(CYL,(50,32)),
//          DCB=(DSORG=PS,RECFM=FB,LRECL=80,BLKSIZE=27920)
//
