//CRTSRCF   JOB   USER=HERC04,PASSWORD=PASS4U,MSGCLASS=A
//          EXEC  PGM=IEFBR14   
//SYSPRINT  DD    SYSOUT=*
//SYSIN     DD    DUMMY
//NEWFILE   DD    DSN=HERC04.SSTATS.SRC,DISP=(NEW,CATLG),
//          UNIT=SYSDA,VOL=SER=PUB013,
//          SPACE=(TRK,(100,10,2)),
//          DCB=(DSORG=PO,RECFM=FB,LRECL=80,BLKSIZE=19040)
//
