//HERC04PD  JOB   USER=HERC04,PASSWORD=PASS4U,MSGCLASS=A
//CPYDTA    EXEC  PGM=IEBGENER
//SYSPRINT  DD    SYSOUT=*
//SYSIN     DD    DUMMY
//SYSUT1    DD    DSN=HERC04.SSTATS.INPILE,DISP=SHR
//SYSUT2    DD    SYSOUT=*
//
