//HERC04RS  JOB   USER=HERC04,PASSWORD=PASS4U,MSGCLASS=A
//          EXEC  PGM=SSTATS
//SYSIN     DD    DUMMY
//SYSOUT    DD    SYSOUT=*
//STEPLIB   DD    DSN=HERC04.SSTATS.LOADLIB,DISP=SHR
//SINPILE   DD    DSN=HERC04.SSTATS.INPILE,DISP=SHR
